import Titlebar from "@/components/ui/Titlebar";
import RouteTitle from "@/components/layout/RouteTitle";
import Audio from "@/components/ui/Audio";
import OurCard from "@/components/ui/OurCard";
import fetchData from "@/lib/fetchItem";
import { MarkdownViewer } from "@/components/layout/ItemDetails";
export default async function HomePage() {
  const res = await fetchData("people");
  const data = res.data;
  console.log(data);

  const introduction = `

मेन्छयायेम गाउँपालिका, कोशी प्रदेशको तेह्रथुम जिल्लामा अवस्थित उत्तर–पूर्वी गाउँपालिका हो, जसको क्षेत्रफल ७०.०९ वर्ग कि.मि. फैलिएको छ। यहाँको भू–भाग दुर्गम भए पनि अत्यन्तै मनोरम छ, जहाँ उच्च पहाडी क्षेत्र, खोला–नाला, समथल बेसी, र लालीगुराँसको घना जंगलले प्राकृतिक सौन्दर्य थपेको छ। ऐतिहासिक र धार्मिक दृष्टिले पनि मेन्छयायेम महत्वपूर्ण छ; यहाँ प्राचीन समयमा तेनाहाङ राजाको दरबार, गौखुरी धाम, र मेन्छयायेम डाँडा जस्ता स्थलहरू रहेका छन्।  

स्थानीय तहको नाम स्थानीय पहिचान, सांस्कृतिक, भाषिक र जातीय सभ्यताका आधारमा राखिएको हो र मेन्छयायेमको नाम लिम्बू धर्म तथा संस्कृतिमा आधारित छ। किम्बदन्ती अनुसार, ‘मेन्छया’ र ‘येप’ शब्दको अपभ्रंशबाट ‘मेन्छयायेम’ नाम उत्पन्न भएको हो। मेन्छयायेम डाँडा तेह्रथुम, संखुवासभा र ताप्लेजुङ जिल्लाको संगम स्थलमा अवस्थित छ र यस डाँडाको धार्मिक तथा सांस्कृतिक महत्वले गाउँपालिकाको जीवनशैली, रीतिरिवाज, र धर्म–संस्कृतिमा गहिरो प्रभाव पारेको छ।  

गाउँपालिकामा कुल ६ वटा वडाहरू रहेका छन्, जसको विवरण यस प्रकार छ:

## वडा विवरण

- **वडा १**  
  - कार्यालयको स्थान: डाँडागाउँ 
  - साबिकको वडा: पौठाक १, २, ३ र ४  
  - क्षेत्रफल: १०.९७ वर्ग कि.मि.   

- **वडा २**  
  - कार्यालयको स्थान: पौठाक गा.वि.स भवन, पौठाक बजार   
  - साबिकको वडा: पौठाक ५, ६, ७, ८, ९  
  - क्षेत्रफल: ८.८९ वर्ग कि.मि.   

- **वडा ३**  
  - कार्यालयको स्थान: श्रीजुङ गा.वि.स भवन, श्रीजुङ बजार    
  - साबिकको वडा: श्रीजुङ  ७, ८, ९  
  - क्षेत्रफल: ६.२७ वर्ग कि.मि.  

- **वडा ४**  
  - कार्यालयको स्थान: श्रीजुङ बजार   
  - साबिकको वडा: मोराहाङ १, २, ३, ४, ५, ६ 
  - क्षेत्रफल: १०.३५ वर्ग कि.मि.   
  
- **वडा ५**
    - कार्यालयको स्थान: मोराहाङ्ग बजार    
    - साबिकको वडा: श्रीजुङ १, २, ३, ७, ८  
    - क्षेत्रफल: १५.७५ वर्ग कि.मि.    

- **वडा ६**  
  - कार्यालयको स्थान: मोराहाङ्ग बजार    
  - साबिकको वडा: मोराहाङ ४, ५, ६, ९ 
  - क्षेत्रफल: १८.४९ वर्ग कि.मि.
  #

मेन्छयायेम गाउँपालिकाले सांस्कृतिक विविधता, ऐतिहासिक महत्त्व र प्राकृतिक सौन्दर्यको अद्वितीय मिश्रण प्रस्तुत गर्दछ, जसले पर्यटक, अनुसन्धानकर्ता, र स्थानीय बासिन्दा सबैका लागि आकर्षणको केन्द्र बनेको छ।  

**वेबसाइट:** [menchhayayemmun.gov.np](https://menchhayayemmun.gov.np)
`;
  return (
    <>
      <RouteTitle title={"पालिका विवरण"} />
      <div className="flex-4/5 ">
        <div className="lg:mt-5">
          <Titlebar title="मेन्छयायेम परीचय" />
          <div className="px-4 py-2 md:text-xl text-justify ">
            <MarkdownViewer content={introduction} />
          </div>
        </div>

        <Audio />
      </div>

      <Titlebar title="REPRESENTATIVES" />
      {data.map((item, index) => (
        <OurCard
          key={index}
          image={item.photo}
          name={item.name}
          position={item.position}
          email={item.email}
          phone={item.phone}
          facebook={item.facebook}
          imgHeight={item.position === "mayor" ? 200 : 150}
          imgWidth={item.position === "mayor" ? 200 : 150}
          height={370}
          width={350}
        />
      ))}
    </>
  );
}
